# RebarShape Class (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
RebarShape Class
Members See Also
---
RebarShape specifies the shape type for a Rebar instance.
**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2009
# Syntax
C#
---
```text
public class RebarShape : ElementType
```

Visual Basic
---
```text
Public Class RebarShape _
	Inherits ElementType
```

Visual C++
---
```text
public ref class RebarShape : public ElementType
```

# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB..::..Element Autodesk.Revit.DB..::..ElementType Autodesk.Revit.DB.Structure..::..RebarShape
# See Also
RebarShape Members
Autodesk.Revit.DB.Structure Namespace